public class MapDev
{
    public char[,] CreatMap()                   // Задаем карту
    {
        char[,] map =
         {
          {'#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#'},
          {'#',' ',' ',' ',' ',' ','#',' ','x',' ',' ',' ',' ',' ','#',' ','x',' ','#'},
          {'#',' ',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ','#'},
          {'#',' ',' ','#',' ',' ',' ','#','#','#','#','#',' ',' ','#',' ',' ',' ','#'},
          {'#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#'},
          {'#',' ',' ','#','#',' ',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ','#'},
          {'#',' ',' ',' ','#',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ','#'},
          {'#',' ','x',' ','#',' ',' ',' ',' ',' ','#',' ','x',' ',' ',' ',' ',' ','#'},
          {'#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#'}
         };
         return map;
    }

    public void PrintMap(char[,] map)    // Рисуем карту
    {
        Console.SetCursorPosition(0, 0);
        for (int indexLineMap = 0; indexLineMap < map.GetLength(0); indexLineMap++)
        {
            for (int indexColumnMap = 0; indexColumnMap < map.GetLength(1); indexColumnMap++)
            {
                Console.Write(map[indexLineMap, indexColumnMap]);
            }
            Console.WriteLine();
        }
    }
}